Tekla Open API Reference for Tekla Structures 2025
SpiralBeam.EndPoint Property
 Gets the spiral beam end point.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point EndPoint { get; }
Public ReadOnly Property EndPoint As Point
	Get
Property Value
Type: Point
See Also
Reference
SpiralBeam Class
Tekla.Structures.Model Namespace